In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1,2,3,4,5,6])

In [3]:
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [4]:
dates = pd.date_range('20221005',periods =6)

In [5]:
dates

DatetimeIndex(['2022-10-05', '2022-10-06', '2022-10-07', '2022-10-08',
               '2022-10-09', '2022-10-10'],
              dtype='datetime64[ns]', freq='D')

In [6]:
dataframe = pd.DataFrame(np.random.randn(6,4),index=dates,columns=['A','B','C','D'])

In [7]:
dataframe

                   A         B         C         D
2022-10-05 -0.266052 -0.021021  0.761863  1.034609
2022-10-06 -0.994581 -1.794547 -2.043368  1.590266
2022-10-07  0.213571  1.084182  0.627270 -0.864878
2022-10-08  0.088691  1.188546 -0.921364  0.052269
2022-10-09  1.534639  0.239565 -0.101703  1.261762
2022-10-10 -0.152556 -0.533473 -0.714299  0.497448

In [8]:
f2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.date_range("20130102",periods=4),
        "C": pd.Series(list(range(4)), index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
f2

     A          B    C  D      E    F
0  1.0 2013-01-02  0.0  3   test  foo
1  1.0 2013-01-03  1.0  3  train  foo
2  1.0 2013-01-04  2.0  3   test  foo
3  1.0 2013-01-05  3.0  3  train  foo

In [9]:
f2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  0.0  3   test  foo
1  1.0 2013-01-03  1.0  3  train  foo
2  1.0 2013-01-04  2.0  3   test  foo
3  1.0 2013-01-05  3.0  3  train  foo

In [10]:
f2.tail()

     A          B    C  D      E    F
0  1.0 2013-01-02  0.0  3   test  foo
1  1.0 2013-01-03  1.0  3  train  foo
2  1.0 2013-01-04  2.0  3   test  foo
3  1.0 2013-01-05  3.0  3  train  foo

In [11]:
f2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 0.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-03 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-04 00:00:00'), 2.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-05 00:00:00'), 3.0, 3, 'train', 'foo']],
      dtype=object)

In [12]:
f2.sort_index(axis=0)

     A          B    C  D      E    F
0  1.0 2013-01-02  0.0  3   test  foo
1  1.0 2013-01-03  1.0  3  train  foo
2  1.0 2013-01-04  2.0  3   test  foo
3  1.0 2013-01-05  3.0  3  train  foo

In [13]:
f2.sort_values(by='C')

     A          B    C  D      E    F
0  1.0 2013-01-02  0.0  3   test  foo
1  1.0 2013-01-03  1.0  3  train  foo
2  1.0 2013-01-04  2.0  3   test  foo
3  1.0 2013-01-05  3.0  3  train  foo

* loc
* iloc

In [14]:
f2.loc[:,'C']

0    0.0
1    1.0
2    2.0
3    3.0
Name: C, dtype: float32

In [15]:
f2.loc[[0,1],['A','B']]

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-03

In [16]:
f2.loc[0:1,['A','B']]

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-03

#### iloc select by position

In [17]:
f2

     A          B    C  D      E    F
0  1.0 2013-01-02  0.0  3   test  foo
1  1.0 2013-01-03  1.0  3  train  foo
2  1.0 2013-01-04  2.0  3   test  foo
3  1.0 2013-01-05  3.0  3  train  foo

In [18]:
f2.iloc[0:3]

     A          B    C  D      E    F
0  1.0 2013-01-02  0.0  3   test  foo
1  1.0 2013-01-03  1.0  3  train  foo
2  1.0 2013-01-04  2.0  3   test  foo

In [19]:
f2.iloc[0:3,0:3]

     A          B    C
0  1.0 2013-01-02  0.0
1  1.0 2013-01-03  1.0
2  1.0 2013-01-04  2.0

In [20]:
f2.apply(np.cumsum)

     A          B    C   D                   E             F
0  1.0 2013-01-02  0.0   3                test           foo
1  2.0 2056-01-05  1.0   6           testtrain        foofoo
2  3.0 2099-01-08  3.0   9       testtraintest     foofoofoo
3  4.0 2142-01-13  6.0  12  testtraintesttrain  foofoofoofoo

In [21]:
f2.apply(lambda x : max(x))

A                    1.0
B    2013-01-05 00:00:00
C                    3.0
D                      3
E                  train
F                    foo
dtype: object

In [22]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [23]:
df

                   A         B         C         D
2022-10-05 -0.577808 -0.611913 -0.139698 -1.577442
2022-10-06  1.109617 -0.646164 -0.117114 -1.441532
2022-10-07  0.775751 -0.096579 -2.128564  2.210804
2022-10-08 -1.083064  1.736143  0.526040  0.337818
2022-10-09 -0.238467 -1.134277  0.155215 -1.300696
2022-10-10 -1.314931 -0.712006 -0.637471  1.211551

In [24]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

df1.loc[dates[0] : dates[1], "E"] = 1

df1

                   A         B         C         D    E
2022-10-05 -0.577808 -0.611913 -0.139698 -1.577442  1.0
2022-10-06  1.109617 -0.646164 -0.117114 -1.441532  1.0
2022-10-07  0.775751 -0.096579 -2.128564  2.210804  NaN
2022-10-08 -1.083064  1.736143  0.526040  0.337818  NaN

In [25]:
df2 = df1.reindex(index=dates[0:3] , columns =list(df.columns))

In [26]:
df2

                   A         B         C         D
2022-10-05 -0.577808 -0.611913 -0.139698 -1.577442
2022-10-06  1.109617 -0.646164 -0.117114 -1.441532
2022-10-07  0.775751 -0.096579 -2.128564  2.210804

In [31]:
df3 = df1.reindex(index=dates[0:5], columns=list(df.columns))

df3.loc[dates[4],['A','B','C','D','E']] = [1,2,3,4,5]

In [32]:
df3

                   A         B         C         D    E
2022-10-05 -0.577808 -0.611913 -0.139698 -1.577442  NaN
2022-10-06  1.109617 -0.646164 -0.117114 -1.441532  NaN
2022-10-07  0.775751 -0.096579 -2.128564  2.210804  NaN
2022-10-08 -1.083064  1.736143  0.526040  0.337818  NaN
2022-10-09  1.000000  2.000000  3.000000  4.000000  5.0